_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_НакоплениеИнвестиционногоНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УСОERP_НакоплениеИнвестиционногоНДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетныйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписанияНДС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСтроительства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УСОERP_ИнвестиционныйНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУслуг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУслугДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаТМЦ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаТМЦДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ИнвестиционныйНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ИнвестиционныйНДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОтражениеДокументовВРеглУчете</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВМеждународномУчете</xr:Item>
				<xr:Item>AccountingRegister.Международный</xr:Item>
				<xr:Item>AccumulationRegister.УСОERP_НДСИнвестиционный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписанияНДС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НДСПоСМР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСтроительства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НДСПоТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСтроительства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВключениеВСтоимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСтроительства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСписанияНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_НакоплениеИнвестиционногоНДС/Ext/ObjectModule.bsl
#Область ПеренесеноИзМодуляМенеджера
#Область ЭкспортныеПроцедурыФункции

// Функция получает данные и возвращает таблицу значений для заполнения сведений по объектам строительства.
//
Функция ПолучитьДанныеЗаполненияПоОбъектамСтроительства(СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода"				  , СтруктураПараметров.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода"			  , СтруктураПараметров.ОкончаниеПериода);
	Запрос.УстановитьПараметр("Организация"					  , СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("НакоплениеНДСПоРаботамУслугам" , СтруктураПараметров.НакоплениеНДСПоРаботамУслугам); 
	Запрос.УстановитьПараметр("НакоплениеНДСПоМатериалам"	  , СтруктураПараметров.НакоплениеНДСПоМатериалам);
					   
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	&Организация КАК Организация,
	               |	НакоплениеНДСПоРаботамУслугам.ОбъектСтроительства КАК ОбъектСтроительства,
	               |	НакоплениеНДСПоРаботамУслугам.СуммаНДС КАК СуммаУслуг
	               |ПОМЕСТИТЬ ВТНакоплениеНДСПоРаботамУслугам
	               |ИЗ
	               |	&НакоплениеНДСПоРаботамУслугам КАК НакоплениеНДСПоРаботамУслугам
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Организация,
	               |	ОбъектСтроительства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	&Организация КАК Организация,
	               |	НакоплениеНДСПоМатериалам.ОбъектСтроительства КАК ОбъектСтроительства,
	               |	НакоплениеНДСПоМатериалам.СуммаНДС КАК СуммаТМЦ
	               |ПОМЕСТИТЬ ВТНакоплениеНДСПоМатериалам
	               |ИЗ
	               |	&НакоплениеНДСПоМатериалам КАК НакоплениеНДСПоМатериалам
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Организация,
	               |	ОбъектСтроительства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТНакоплениеНДСПоРаботамУслугам.Организация КАК Организация,
	               |	ВТНакоплениеНДСПоРаботамУслугам.ОбъектСтроительства КАК ОбъектСтроительства,
	               |	ВТНакоплениеНДСПоРаботамУслугам.СуммаУслуг КАК СуммаУслуг,
	               |	0 КАК СуммаТМЦ
	               |ПОМЕСТИТЬ ВТНакоплениеНДСПоРаботамУслугамМатериалам
	               |ИЗ
	               |	ВТНакоплениеНДСПоРаботамУслугам КАК ВТНакоплениеНДСПоРаботамУслугам
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТНакоплениеНДСПоМатериалам.Организация,
	               |	ВТНакоплениеНДСПоМатериалам.ОбъектСтроительства,
	               |	0,
	               |	ВТНакоплениеНДСПоМатериалам.СуммаТМЦ
	               |ИЗ
	               |	ВТНакоплениеНДСПоМатериалам КАК ВТНакоплениеНДСПоМатериалам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТНакоплениеНДСПоРаботамУслугамМатериалам.Организация КАК Организация,
	               |	ВТНакоплениеНДСПоРаботамУслугамМатериалам.ОбъектСтроительства КАК ОбъектСтроительства,
	               |	СУММА(ВТНакоплениеНДСПоРаботамУслугамМатериалам.СуммаУслуг) КАК СуммаУслуг,
	               |	СУММА(ВТНакоплениеНДСПоРаботамУслугамМатериалам.СуммаТМЦ) КАК СуммаТМЦ
	               |ПОМЕСТИТЬ ВТНакоплениеНДССвернутаяПоРаботамУслугамМатериалам
	               |ИЗ
	               |	ВТНакоплениеНДСПоРаботамУслугамМатериалам КАК ВТНакоплениеНДСПоРаботамУслугамМатериалам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТНакоплениеНДСПоРаботамУслугамМатериалам.ОбъектСтроительства,
	               |	ВТНакоплениеНДСПоРаботамУслугамМатериалам.Организация
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Организация,
	               |	ОбъектСтроительства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НакоплениеНДСПоРаботамУслугам.Ссылка КАК Документ,
	               |	ИнвестиционныйНДС.Организация КАК Организация,
	               |	НакоплениеНДСПоРаботамУслугам.ОбъектСтроительства КАК ОбъектСтроительства,
	               |	НакоплениеНДСПоРаботамУслугам.СуммаНДС КАК СуммаУслугДокумента,
	               |	0 КАК СуммаТМЦДокумента
	               |ПОМЕСТИТЬ ВТДокументыИнвестиционныйНДС
	               |ИЗ
	               |	Документ.УСОERP_ИнвестиционныйНДС.НДСПоСМР КАК НакоплениеНДСПоРаботамУслугам
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УСОERP_ИнвестиционныйНДС КАК ИнвестиционныйНДС
	               |		ПО НакоплениеНДСПоРаботамУслугам.Ссылка = ИнвестиционныйНДС.Ссылка
	               |ГДЕ
	               |	ИнвестиционныйНДС.Проведен
	               |	И ИнвестиционныйНДС.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	               |	И ИнвестиционныйНДС.Организация = &Организация
	               |	И НакоплениеНДСПоРаботамУслугам.ОбъектСтроительства В
	               |			(ВЫБРАТЬ
	               |				ВТНакоплениеНДССвернутаяПоРаботамУслугамМатериалам.ОбъектСтроительства
	               |			ИЗ
	               |				ВТНакоплениеНДССвернутаяПоРаботамУслугамМатериалам КАК ВТНакоплениеНДССвернутаяПоРаботамУслугамМатериалам)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НакоплениеНДСПоМатериалам.Ссылка,
	               |	ИнвестиционныйНДС.Организация,
	               |	НакоплениеНДСПоМатериалам.ОбъектСтроительства,
	               |	0,
	               |	НакоплениеНДСПоМатериалам.СуммаНДС
	               |ИЗ
	               |	Документ.УСОERP_ИнвестиционныйНДС.НДСПоТМЦ КАК НакоплениеНДСПоМатериалам
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УСОERP_ИнвестиционныйНДС КАК ИнвестиционныйНДС
	               |		ПО НакоплениеНДСПоМатериалам.Ссылка = ИнвестиционныйНДС.Ссылка
	               |ГДЕ
	               |	ИнвестиционныйНДС.Проведен
	               |	И ИнвестиционныйНДС.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	               |	И ИнвестиционныйНДС.Организация = &Организация
	               |	И НакоплениеНДСПоМатериалам.ОбъектСтроительства В
	               |			(ВЫБРАТЬ
	               |				ВТНакоплениеНДССвернутаяПоРаботамУслугамМатериалам.ОбъектСтроительства
	               |			ИЗ
	               |				ВТНакоплениеНДССвернутаяПоРаботамУслугамМатериалам КАК ВТНакоплениеНДССвернутаяПоРаботамУслугамМатериалам)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТДокументыИнвестиционныйНДС.Документ КАК Документ,
	               |	ВТДокументыИнвестиционныйНДС.Организация КАК Организация,
	               |	ВТДокументыИнвестиционныйНДС.ОбъектСтроительства КАК ОбъектСтроительства,
	               |	СУММА(ВТДокументыИнвестиционныйНДС.СуммаУслугДокумента) КАК СуммаУслугДокумента,
	               |	СУММА(ВТДокументыИнвестиционныйНДС.СуммаТМЦДокумента) КАК СуммаТМЦДокумента
	               |ПОМЕСТИТЬ ВТДокументыИнвестиционныйНДССвернутые
	               |ИЗ
	               |	ВТДокументыИнвестиционныйНДС КАК ВТДокументыИнвестиционныйНДС
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТДокументыИнвестиционныйНДС.Организация,
	               |	ВТДокументыИнвестиционныйНДС.ОбъектСтроительства,
	               |	ВТДокументыИнвестиционныйНДС.Документ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Организация,
	               |	ОбъектСтроительства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТНакоплениеНДССвернутаяПоРаботамУслугамМатериалам.ОбъектСтроительства КАК ОбъектСтроительства,
	               |	ЕСТЬNULL(ВТДокументыИнвестиционныйНДССвернутые.Документ, ЗНАЧЕНИЕ(Документ.УСОERP_ИнвестиционныйНДС.ПустаяСсылка)) КАК Документ,
	               |	ВТНакоплениеНДССвернутаяПоРаботамУслугамМатериалам.СуммаУслуг КАК СуммаУслуг,
	               |	ЕСТЬNULL(ВТДокументыИнвестиционныйНДССвернутые.СуммаУслугДокумента, 0) КАК СуммаУслугДокумента,
	               |	ВТНакоплениеНДССвернутаяПоРаботамУслугамМатериалам.СуммаТМЦ КАК СуммаТМЦ,
	               |	ЕСТЬNULL(ВТДокументыИнвестиционныйНДССвернутые.СуммаТМЦДокумента, 0) КАК СуммаТМЦДокумента
	               |ИЗ
	               |	ВТНакоплениеНДССвернутаяПоРаботамУслугамМатериалам КАК ВТНакоплениеНДССвернутаяПоРаботамУслугамМатериалам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыИнвестиционныйНДССвернутые КАК ВТДокументыИнвестиционныйНДССвернутые
	               |		ПО ВТНакоплениеНДССвернутаяПоРаботамУслугамМатериалам.Организация = ВТДокументыИнвестиционныйНДССвернутые.Организация
	               |			И ВТНакоплениеНДССвернутаяПоРаботамУслугамМатериалам.ОбъектСтроительства = ВТДокументыИнвестиционныйНДССвернутые.ОбъектСтроительства";
	
	Возврат Запрос.Выполнить().Выгрузить();
				   	
КонецФункции // ПолучитьДанныеЗаполненияПоОбъектамСтроительства()

// Процедура получает/создает документ "Инвестиционный НДС" и заполняет его текущими данными обработки.
//
Процедура СоздатьДокументИнвестиционныйНДСПоОбъектуСтроительства(Объект, СтрокаТаблицы) Экспорт
	
	ИнвестиционныйНДС = ПолучитьСоздатьДокументИнвестиционныйНДС(СтрокаТаблицы);
	ЗаполнитьЗначенияСвойств(ИнвестиционныйНДС, Объект, "Организация, СчетСписанияНДС, Комментарий, Ответственный");
	
	ИнвестиционныйНДС.Дата				  = ?(ЗначениеЗаполнено(ИнвестиционныйНДС.Дата), ИнвестиционныйНДС.Дата, КонецМесяца(Объект.ОтчетныйПериод));
	ИнвестиционныйНДС.ОбъектСтроительства = СтрокаТаблицы.ОбъектСтроительства;
	ИнвестиционныйНДС.СпособСтроительства = ПолучитьСпособСтроительстваПоОбъектуСтроительства(СтрокаТаблицы);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачалоПериода"	   , НачалоМесяца(ИнвестиционныйНДС.Дата));
	СтруктураПараметров.Вставить("ОкончаниеПериода"	   , КонецМесяца(ИнвестиционныйНДС.Дата));
	СтруктураПараметров.Вставить("Организация"		   , ИнвестиционныйНДС.Организация);
	СтруктураПараметров.Вставить("ОбъектСтроительства" , ИнвестиционныйНДС.ОбъектСтроительства);
	
	ИнвестиционныйНДС.НДСПоСМР.Загрузить(УСОERP_ДолевоеСтроительствоСервер.ПолучитьДанныеНакопленияНДСПоРаботамУслугам(СтруктураПараметров));
	ИнвестиционныйНДС.НДСПоТМЦ.Загрузить(УСОERP_ДолевоеСтроительствоСервер.ПолучитьДанныеНакопленияНДСПоМатериалам(СтруктураПараметров));
	
	СтруктураПараметров.Вставить("ДатаДокумента"				 , ИнвестиционныйНДС.Дата);
	СтруктураПараметров.Вставить("НакоплениеНДСПоРаботамУслугам" , ИнвестиционныйНДС.НДСПоСМР.Выгрузить()); 
	СтруктураПараметров.Вставить("НакоплениеНДСПоМатериалам"	 , ИнвестиционныйНДС.НДСПоТМЦ.Выгрузить()); 
	
	ИнвестиционныйНДС.ВключениеВСтоимость.Загрузить(УСОERP_ДолевоеСтроительствоСервер.ПолучитьДанныеВключениеНДСВСтоимостьОбъекта(СтруктураПараметров));
	
	Попытка
		ИнвестиционныйНДС.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось провести документ по объекту строительсва """ +
				Строка(СтрокаТаблицы.ОбъектСтроительства) + """ по причине: '") + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ИнвестиционныйНДС.Ссылка) Тогда
		ОбновитьЗначенияРеквизитовСтрокиТаблицы(ИнвестиционныйНДС, СтрокаТаблицы);
	КонецЕсли;
		
КонецПроцедуры // СоздатьДокументИнвестиционныйНДСПоОбъектуСтроительства()

#КонецОбласти

#Область ВспомогательныеФункции

// Функция получает или создает документ "Инвестиционный НДС" и возвращает его объект. 
//
Функция ПолучитьСоздатьДокументИнвестиционныйНДС(СтрокаТаблицы)

	Если ЗначениеЗаполнено(СтрокаТаблицы.Документ) Тогда
		Возврат СтрокаТаблицы.Документ.ПолучитьОбъект();
	КонецЕсли;
	
	Возврат Документы.УСОERP_ИнвестиционныйНДС.СоздатьДокумент();

КонецФункции // ПолучитьСоздатьДокументИнвестиционныйНДС()

// Функция получает и возвращает значение доп. реквизита объекта строительства "Способ строительства".
//
Функция ПолучитьСпособСтроительстваПоОбъектуСтроительства(СтрокаТаблицы)
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ОбъектСтроительства", СтрокаТаблицы.ОбъектСтроительства);
	//
	//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//               |	ОбъектыЭксплуатацииДополнительныеРеквизиты.Значение КАК СпособСтроительства
	//               |ИЗ
	//               |	Справочник.ОбъектыЭксплуатации.ДополнительныеРеквизиты КАК ОбъектыЭксплуатацииДополнительныеРеквизиты
	//               |ГДЕ
	//               |	ОбъектыЭксплуатацииДополнительныеРеквизиты.Ссылка = &ОбъектСтроительства
	//               |	И ОбъектыЭксплуатацииДополнительныеРеквизиты.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.УСОERP_СпособСтроительства)";
	//			   
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Возврат Выборка.СпособСтроительства;
	//КонецЕсли;
	//
	//Возврат Перечисления.СпособыСтроительства.ПустаяСсылка();
	
	возврат СтрокаТаблицы.ОбъектСтроительства.УСОERP_СпособСтроительства;
	
КонецФункции // ПолучитьСпособСтроительстваПоОбъектуСтроительства()

// Процедура обновляет реквизиты строки табл. части "Объекты строительства" данными с документа "Инвестиционный НДС".
//
Процедура ОбновитьЗначенияРеквизитовСтрокиТаблицы(ИнвестиционныйНДС, СтрокаТаблицы)

	СтрокаТаблицы.Документ = ИнвестиционныйНДС.Ссылка;
	
	СтрокаТаблицы.СуммаУслугДокумента = ИнвестиционныйНДС.НДСПоСМР.Итог("СуммаНДС");
	СтрокаТаблицы.СуммаТМЦДокумента	  = ИнвестиционныйНДС.НДСПоТМЦ.Итог("СуммаНДС");
	
КонецПроцедуры // ОбновитьЗначенияРеквизитовСтрокиТаблицы()

#КонецОбласти

#КонецОбласти
